# server_clinic/server_clinic/constants.py
# * for server_clinic/death/
DEATH_PLACE_CHOICES = (
    ("дома", "На дому"),
    ("стационар", "В стационаре"),
    ("место_происшествия", "На месте происшествия"),
    ("смп", "В машине СМП"),
    ("другое", "В другом месте"),
)

# * server_clinic/diagnos/
# Статус диспансерного учёта
DISP_STATUS_CHOICES = [
    ("состоит", "Состоит"),
    ("с_впервые", "С впервые"),
    ("с_ранее", "С ранее"),
]

# Причина первичного выявления (только для статуса 'с впервые')
PRIMARY_REASON_CHOICES = [
    ("профосмотр", "При профосмотре"),
    ("заболевание", "По заболеванию"),
]

# Причина снятия с диспансерного учёта
REMOVE_REASON_CHOICES = [
    ("не_явился", "Не явился"),
    ("умер", "Умер"),
    ("перешёл", "Перешёл в другое МО"),
    ("выздоровел", "Выздоровел"),
]

# * server_clinic/disabled_children/
STATUS_CHOICES = [
    ("registered", "Состоит"),
    ("new_current_mo", "Впервые установлена в текущем МО"),
    ("new_other_mo", "Прибыл с впервые установленной из другого МО"),
    ("existing_other_mo", "Прибыл с ранее установленной из другого МО"),
    ("renewed", "Возобновление прерванной инвалидности"),
]

REMOVAL_REASONS = [
    ("moved", "Выбыл на другое место жительства"),
    ("removed", "Снятие инвалидности МСЭК"),
    ("died", "Умер"),
    ("adult", "Выбыл по достижению 18 лет"),
    ("refusal", "Отказ от переосвидетельствования"),
    ("diagnosis_change", "Изменение диагноза"),
    ("error", "Ошибочная постановка"),
]

PRIMARY_STATUS = [
    "new_current_mo",
    "new_other_mo",
    "renewed",
]

REMOVAL_STATUS = [
    "moved",
    "removed",
    "died",
    "adult",
    "refusal",
    "diagnosis_change",
    "error",
]

# * server_clinic/patient/
# Константы для выбора пола
GENDER_CHOICES = [("М", "Мужской"), ("Ж", "Женский")]

# Константа для выбора филиала
FILIAL = [
    ("1", "ГБ Троицкая амбулатория 1"),
    ("2", "ГБ Троицкая амбулатория 2"),
    ("3", "ГБ Троицкая амбулатория 3"),
    ("4", "ГБ Троицкая амбулатория 4"),
    ("5", "ГБ Троицкая (ПО)"),
    ("6", "ГБ Троицкая (ДО)"),
    ("7", "ГБ Троицкая филиал 1"),
    ("8", "ГБ Троицкая филиал 2"),
    ("9", "ГБ Троицкая филиал 3"),
    ("10", "ГБ Троицкая филиал 4"),
    ("11", "ГБ Троицкая филиал 5"),
]
