# server_clinic/patient/constants.py
# Константы для выбора пола
GENDER_CHOICES = [("М", "Мужской"), ("Ж", "Женский")]

# Константа для выбора филиала
FILIAL = [
    ("1", "ГБ Троицкая амбулатория 1"),
    ("2", "ГБ Троицкая амбулатория 2"),
    ("3", "ГБ Троицкая амбулатория 3"),
    ("4", "ГБ Троицкая амбулатория 4"),
    ("5", "ГБ Троицкая (ПО)"),
    ("6", "ГБ Троицкая (ДО)"),
    ("7", "ГБ Троицкая филиал 1"),
    ("8", "ГБ Троицкая филиал 2"),
    ("9", "ГБ Троицкая филиал 3"),
    ("10", "ГБ Троицкая филиал 4"),
    ("11", "ГБ Троицкая филиал 5"),
]